artillery.yml
config:
  target: 'http://localhost:3004'
  phases:
    - duration: 20
      arrivalRate: 10
      rampTo: 250
      name: 'warming up'
    - duration: 2
      arrivalRate: 1000
      name: 'spiking'
  variables:
    carIds:
      - [432, 1, 63899, 200000, 439543]
      - [54329, 54392, 74378, 54, 4, 2, 899]
      
  
    
  defaults:
scenarios:
  - flow:
    - loop:
      - get:
          url: "/api/details?term={{ $loopElement }}"s
          over: carIds